tap "azure/kubelogin"
tap "hashicorp/tap"
tap "kyverno/chainsaw"

# Core Shell & CLI Utilities
brew "starship"      # Cross-shell prompt
brew "zoxide"        # Smart cd
brew "fzf"           # Fuzzy finder
brew "bat"           # Better cat
brew "eza"           # Better ls
brew "fd"            # Better find
brew "ripgrep"       # Better grep
brew "mise"          # Polyglot runtime manager
brew "direnv"        # Env management
brew "nushell"       # Modern shell
brew "stow"          # Dotfile management
brew "yq"            # YAML processor
brew "jq"            # JSON processor
brew "difftastic"    # Better diff output

# Editor & Terminal
brew "neovim"
cask "ghostty"
cask "visual-studio-code"
cask "font-jetbrains-mono"

# GUI & Productivity
cask "1password"
cask "alfred"
cask "alt-tab"

# Kubernetes & Cloud Tools
brew "kubernetes-cli"
brew "k9s"
brew "kubectx"
brew "helm@3"
brew "helmfile"
brew "kind"
brew "argocd"
brew "crossplane"
brew "azure/kubelogin/kubelogin"
brew "kyverno/chainsaw/chainsaw"
brew "dive"

# Development Tools
brew "go"
brew "ansible"
brew "hashicorp/tap/packer"
brew "tenv"
brew "sops"
brew "age"
brew "gnupg"
brew "glab"
brew "doggo"
brew "watch"

# VS Code Extensions
vscode "golang.go"
vscode "harrydowning.yaml-embedded-languages"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-vscode.makefile-tools"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
