golang.go
harrydowning.yaml-embedded-languages
hashicorp.terraform
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-vscode.makefile-tools
redhat.ansible
redhat.vscode-yaml
thenuprojectcontributors.vscode-nushell-lang
